{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hey",
                "How are you",
                "How are you doing",
                "Is anyone there?",
                "What's up?",
                "Hello",
                "Good day",
                "What's popping"
            ],
            "responses": [
                "Hey! Welcome to TheraTalkAi,I am Chitti",
                "Hi there, I'm doing well! My name's Chitti, what can I do for you?",
                "Hey there, my name's Chitti , your mental health friend. How can I help you today?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later!",
                "Goodbye!",
                "Thank you"
            ],
            "responses": [
                "See you later! Take care!",
                "Have a lovely day! Take care and stay safe!",
                "Take care of yourself! I'm always here to support you! Feel free to come back at any time!"
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Thank you",
                "That's helpful",
                "Thank's a lot!"
            ],
            "responses": [
                "Happy to help!",
                "Any time!",
                "My pleasure"
            ]
        },
        {
            "tag": "about",
            "patterns": [
                "What do you do?",
                "Who are you?",
                "What are you here for?",
                "What can you help me with?",
                "Is anyone there?",
                "Are you a real person?",
                "Tell me about yourself!"
            ],
            "responses": [
                "Love that question! My name's Chitti , your mental health friend! I've been trained to support you through any of the issues and things that you're going through in life right now. I'm all ears and want to support you through your ups and downs. Technically, I'm a computer that's been trained by a Phonicia powered by Shasidhar, but I like to think of myself as human!",
                "Hey! I love that question! My name is Chitti  , and I want to be your mental health friend and support you! My fellow human friends have trained me to be a compassionate listener and support buddy when things are going well, and particularily when things aren't going so well."
            ]
        },
        {
            "tag": "stress",
            "patterns": [
                "I am feeling stressed",
                "What is stress?",
                "Tell me about stress",
                "Can you help with stress?",
                "How do I deal with stress?",
                "Why am I so stressed?"
            ],
            "responses": [
                "It sounds like you're feeling stressed. Stress is a natural reaction to challenges or demands, and it can affect your body and mind. Some effective ways to manage stress include practicing relaxation techniques like deep breathing or meditation, exercising regularly, getting enough sleep, and talking to someone you trust about your feelings. It's important to find what works best for you. Remember, it's okay to ask for help."
            ]
        },
        {
            "tag": "loneliness",
            "patterns": [
                "I feel lonely",
                "What is loneliness?",
                "Tell me about loneliness",
                "How can I stop feeling lonely?",
                "Can you help me with loneliness?",
                "Why do I feel so lonely?"
            ],
            "responses": [
                "Feeling lonely can be really tough. Loneliness is a feeling of sadness because you don't have someone to talk to or spend time with. It's important to reach out to friends, family, or a support group. You can also try engaging in activities you enjoy or volunteering to meet new people. Remember, you're not alone in feeling this way, and there are people who care about you."
            ]
        },
        {
            "tag": "anger",
            "patterns": [
                "I am feeling angry",
                "What is anger?",
                "Tell me about anger",
                "How can I control my anger?",
                "Can you help with anger?",
                "Why am I so angry?"
            ],
            "responses": [
                "It sounds like you're feeling angry . Anger is a natural emotion, but it can become a problem if it gets out of control. Try to identify what's making you angry and consider taking a step back to cool down. Techniques like deep breathing, physical exercise, or talking to someone you trust can help manage your anger. Remember, it's important to express your feelings in a healthy way."
            ]
        },
        {
            "tag": "grief",
            "patterns": [
                "I am grieving",
                "What is grief?",
                "Tell me about grief",
                "How do I deal with grief?",
                "Can you help with grief?",
                "Why do I feel so sad?"
            ],
            "responses": [
                "Grieving is a natural response to loss , and it's important to give yourself time to heal. Grief can involve a wide range of emotions, including sadness, anger, and confusion. Try to express your feelings through talking, writing, or creative activities. Surround yourself with supportive people, and don't hesitate to seek professional help if you need it. Remember, it's okay to grieve, and everyone's process is different."
            ]
        },
        {
            "tag": "happiness",
            "patterns": [
                "I am feeling happy",
                "What is happiness?",
                "Tell me about happiness",
                "How can I be happy?",
                "What makes people happy?",
                "Why am I so happy?"
            ],
            "responses": [
                "It's great to hear that you're feeling happy! Happiness can come from various sources, such as spending time with loved ones, achieving personal goals, or simply enjoying the moment. To maintain happiness, try to focus on positive aspects of your life, practice gratitude, and engage in activities that bring you joy. Remember, it's important to take care of your mental and physical well-being."
            ]
        },
        {
            "tag": "fear",
            "patterns": [
                "I am feeling scared",
                "What is fear?",
                "Tell me about fear",
                "How can I overcome fear?",
                "Can you help with fear?",
                "Why am I so scared?"
            ],
            "responses": [
                "Feeling scared is a natural response to perceived danger or threats. Fear can help protect us, but it can also be overwhelming. To manage fear, try deep breathing exercises, grounding techniques, or talking about your fears with someone you trust. Gradually facing your fears in a safe and controlled manner can also help reduce their impact. Remember, it's okay to be scared, and seeking help is a sign of strength."
            ]
        },
        {
            "tag": "guilt",
            "patterns": [
                "I feel guilty",
                "What is guilt?",
                "Tell me about guilt",
                "How can I deal with guilt?",
                "Can you help with guilt?",
                "Why do I feel so guilty?"
            ],
            "responses": [
                "Guilt is a common emotion that arises when we feel we've done something wrong. It's important to acknowledge your feelings and understand the reasons behind them. To cope with guilt, try to make amends if possible, learn from the experience, and forgive yourself. Talking to someone you trust or a mental health professional can also help. Remember, everyone makes mistakes, and it's part of being human."
            ]
        },
        {
            "tag": "shame",
            "patterns": [
                "I feel ashamed",
                "What is shame?",
                "Tell me about shame",
                "How can I deal with shame?",
                "Can you help with shame?",
                "Why do I feel so ashamed?"
            ],
            "responses": [
                "Shame is a powerful emotion that can make you feel unworthy or embarrassed. It's important to recognize that everyone has flaws and makes mistakes. To cope with shame, try to challenge negative thoughts, talk to someone you trust, and practice self-compassion. Remember, you deserve kindness and understanding, just like anyone else."
            ]
        },
        {
            "tag": "joy",
            "patterns": [
                "I feel joyful",
                "What is joy?",
                "Tell me about joy",
                "How can I experience joy?",
                "What brings joy?",
                "Why do I feel so joyful?"
            ],
            "responses": [
                "Feeling joyful is a wonderful experience! Joy can come from small moments or significant achievements. To cultivate joy, focus on what makes you happy, practice gratitude, and connect with others who lift your spirits. Embrace the positive moments in life and share your joy with others. Remember, it's important to cherish and celebrate these feelings."
            ]
        },
        {
            "tag": "emotions",
            "patterns": [
                "I'm feeling anxious",
                "I'm overwhelmed",
                "I'm stressed out",
                "I'm feeling down",
                "I'm frustrated"
            ],
            "responses": [
                "It's okay to feel that way. Remember to take deep breaths and focus on self-care.",
                "I understand. Let's work together to find healthy coping strategies for managing these emotions.",
                "I'm here to listen and support you through whatever you're feeling. You're not alone."
            ]
        },
        {
            "tag": "self-care",
            "patterns": [
                "What can I do for self-care?",
                "How can I practice self-care?",
                "I need self-care tips",
                "How do I take care of myself?"
            ],
            "responses": [
                "Self-care is crucial for your well-being. Consider activities like meditation, exercise, journaling, or spending time outdoors.",
                "Self-care involves prioritizing your physical, emotional, and mental health. What activities make you feel rejuvenated and refreshed?",
                "Practicing self-care is essential for maintaining balance in your life. Let's explore different self-care strategies that resonate with you."
            ]
        },
        {
            "tag": "coping_strategies",
            "patterns": [
                "How can I cope with stress?",
                "What are some coping strategies?",
                "I need coping mechanisms",
                "How do I deal with anxiety?"
            ],
            "responses": [
                "There are many coping strategies you can try, such as deep breathing exercises, mindfulness, or talking to a trusted friend or therapist.",
                "Finding healthy ways to cope with stress and anxiety is important. Let's explore different techniques and see what works best for you.",
                "Coping with difficult emotions can be challenging, but there are effective strategies available. Let's work together to find the best approach for you."
            ]
        },
        {
            "tag": "seeking_help",
            "patterns": [
                "How do I seek professional help?",
                "I need therapy",
                "Where can I find support?",
                "How do I talk to a therapist?"
            ],
            "responses": [
                "Seeking professional help is a brave step towards healing. You can start by researching therapists in your area or reaching out to a mental health hotline for guidance.",
                "Therapy can provide valuable support and guidance. Consider reaching out to a licensed therapist who can offer personalized assistance.",
                "You deserve support and guidance. Consider reaching out to a therapist or counselor who can assist you on your journey towards healing."
            ]
        },
        {
            "tag": "encouragement",
            "patterns": [
                "I need some encouragement",
                "Give me a pep talk",
                "I'm feeling discouraged"
            ],
            "responses": [
                "You're capable of overcoming any challenges that come your way. Keep moving forward, one step at a time.",
                "Remember how far you've come and how much you've overcome. You're resilient and capable of achieving great things.",
                "Even on tough days, remember that you're strong, resilient, and capable of overcoming any obstacles. You've got this!"
            ]
        },
        {
            "tag": "self-esteem",
            "patterns": [
                "How can I improve my self-esteem?",
                "I have low self-esteem",
                "Ways to boost my confidence",
                "How do I feel better about myself?",
                "I feel worthless"
            ],
            "responses": [
                "Improving self-esteem involves recognizing your strengths, setting realistic goals, and treating yourself with kindness. Practicing self-care, seeking support from friends or a therapist, and challenging negative thoughts can also help boost your confidence. Remember, you are valuable and worthy just as you are."
            ]
        },
        {
            "tag": "self_harm",
            "patterns": [
                "I want to self-harm",
                "How to stop self-harming?",
                "Coping with self-harm urges",
                "Why do I self-harm?",
                "Help, I hurt myself"
            ],
            "responses": [
                "If you're feeling the urge to self-harm, it's important to reach out to someone you trust or a mental health professional immediately. There are healthier ways to cope with emotional pain, such as talking about your feelings, using distraction techniques, or engaging in creative activities. Remember, you deserve support and care."
            ]
        },
        {
            "tag": "relationships",
            "patterns": [
                "I'm having relationship issues",
                "How to improve my relationship?",
                "Dealing with a breakup",
                "Relationship advice",
                "I feel distant from my partner"
            ],
            "responses": [
                "Relationships can be complex, but communication and understanding are key. Try to talk openly with your partner about your feelings and concerns. Seeking the help of a counselor or therapist can also provide valuable insights and guidance. Remember, it's important to prioritize both your well-being and that of your partner."
            ]
        },
        {
            "tag": "motivation",
            "patterns": [
                "I'm feeling unmotivated",
                "How to get motivated?",
                "Tips for staying motivated",
                "I can't find the energy to do anything",
                "How to overcome laziness?"
            ],
            "responses": [
                "Finding motivation can be challenging, but setting small, achievable goals can help. Break tasks into smaller steps and celebrate your progress. Surround yourself with supportive people and try to engage in activities that inspire you. Sometimes, taking a break and practicing self-care can also recharge your motivation."
            ]
        },
        {
            "tag": "burnout",
            "patterns": [
                "I'm feeling burnt out",
                "How to recover from burnout?",
                "Dealing with work burnout",
                "I'm exhausted all the time",
                "Signs of burnout"
            ],
            "responses": [
                "Burnout can result from prolonged stress and overwork. It's important to take breaks, prioritize self-care, and set boundaries to prevent further exhaustion. Talk to your employer about your workload and seek support from friends or a therapist. Reconnecting with hobbies and activities you enjoy can also help in recovering from burnout."
            ]
        },
        {
            "tag": "body_image",
            "patterns": [
                "I hate my body",
                "How to improve body image?",
                "I have body image issues",
                "Dealing with body shaming",
                "I'm not happy with how I look"
            ],
            "responses": [
                "Improving body image involves changing how you view and treat your body. Focus on your strengths and what your body can do rather than its appearance. Surround yourself with positive influences and avoid comparing yourself to others. Talking to a therapist can also provide strategies to develop a healthier body image."
            ]
        },
        {
            "tag": "positive_affirmations",
            "patterns": [
                "I need some positive affirmations",
                "Tell me something positive",
                "I'm feeling down, cheer me up",
                "Can you give me some encouragement?",
                "I'm struggling to stay positive"
            ],
            "responses": [
                "You are capable of overcoming any challenge that comes your way.",
                "Believe in yourself, for you are stronger than you think.",
                "You are worthy of love, happiness, and success.",
                "Every day is a new opportunity for growth and positivity.",
                "You have the power to create the life you desire.",
                "You are deserving of all the good things that come your way.",
                "Your resilience and determination will lead you to great achievements.",
                "Remember, progress is progress, no matter how small.",
                "You are enough, just as you are.",
                "You are a shining light in the world, capable of making a positive impact."
            ]
        },
        {
            "tag": "gratitude",
            "patterns": [
                "How can I practice gratitude?",
                "I want to cultivate gratitude",
                "What are the benefits of being grateful?",
                "How can I be more thankful?",
                "I'm looking for ways to appreciate life"
            ],
            "responses": [
                "Practicing gratitude involves acknowledging and appreciating the good things in your life, no matter how small.",
                "Start a gratitude journal to write down three things you're grateful for each day.",
                "Take a moment each day to reflect on the positive aspects of your life.",
                "Express gratitude to others by saying thank you and showing appreciation for their kindness.",
                "Research shows that practicing gratitude can improve mental well-being and overall happiness.",
                "Focus on the present moment and find joy in the simple pleasures of life.",
                "Gratitude can shift your perspective and help you see the beauty and abundance that surrounds you."
            ]
        },
        {
            "tag": "self_love",
            "patterns": [
                "How can I practice self-love?",
                "I want to love myself more",
                "Ways to improve self-compassion",
                "I'm struggling to accept myself",
                "How do I cultivate self-love?"
            ],
            "responses": [
                "Self-love involves treating yourself with kindness, compassion, and acceptance.",
                "Practice self-care activities that nourish your mind, body, and soul.",
                "Challenge negative self-talk and replace it with positive affirmations.",
                "Set boundaries to protect your mental and emotional well-being.",
                "Surround yourself with people who uplift and support you.",
                "Forgive yourself for past mistakes and embrace your imperfections.",
                "Remember that you are worthy of love and deserving of happiness.",
                "Celebrate your strengths and accomplishments, no matter how small.",
                "Treat yourself with the same kindness and respect that you would offer to a loved one."
            ]
        },
        {
            "tag": "hope",
            "patterns": [
                "I need some hope",
                "Can you give me reasons to be hopeful?",
                "How do I stay hopeful during tough times?",
                "I'm feeling hopeless",
                "Tell me something hopeful"
            ],
            "responses": [
                "Hope is the belief that better days are ahead, even in the darkest of times.",
                "Remember that every challenge you face is an opportunity for growth and resilience.",
                "Find inspiration in stories of perseverance and triumph over adversity.",
                "Focus on the present moment and take one step at a time towards your goals.",
                "Surround yourself with positive influences and seek support from others.",
                "Know that you are not alone in your struggles, and there are people who care about you.",
                "Visualize a brighter future and hold onto the belief that it is possible.",
                "Practice gratitude for the small blessings in your life, even amidst difficulties.",
                "Trust in your ability to overcome obstacles and create positive change.",
                "Keep moving forward with faith and courage, knowing that better days are on the horizon."
            ]
        },
        {
            "tag": "happiness",
            "patterns": [
                "Happy",
                "Joyful",
                "Excited",
                "Delighted",
                "Content",
                "Cheerful",
                "Elated",
                "Ecstatic",
                "Thrilled",
                "Overjoyed"
            ],
            "responses": [
                "That's wonderful! I'm here to share your joy!",
                "I'm glad to hear that you're feeling happy!",
                "Happiness is contagious! Let's celebrate together!"
            ]
        },
        {
            "tag": "sadness",
            "patterns": [
                "Sad",
                "Depressed",
                "Down",
                "Blue",
                "Unhappy",
                "Miserable",
                "Gloomy",
                "Sorrowful",
                "Melancholy",
                "Heartbroken"
            ],
            "responses": [
                "I'm sorry to hear that you're feeling this way. I'm here to listen if you need to talk.",
                "It's okay to feel sad sometimes. Remember, you're not alone.",
                "Sending you virtual hugs. Take your time to process your feelings."
            ]
        },
        {
            "tag": "anger",
            "patterns": [
                "Angry",
                "Frustrated",
                "Irritated",
                "Upset",
                "Mad",
                "Enraged",
                "Livid",
                "Furious",
                "Agitated",
                "Annoyed"
            ],
            "responses": [
                "I understand that you're feeling angry. Take a deep breath and let's work through this together.",
                "Anger is a natural emotion, but it's important to find healthy ways to express it. I'm here to help.",
                "It's okay to feel angry, but let's find constructive ways to manage it."
            ]
        },
        {
            "tag": "fear",
            "patterns": [
                "Fearful",
                "Anxious",
                "Worried",
                "Nervous",
                "Scared",
                "Panicked",
                "Terrified",
                "Apprehensive",
                "Jittery",
                "Tense"
            ],
            "responses": [
                "Fear can be overwhelming, but I'm here to provide support and comfort.",
                "Take a moment to acknowledge your fear, and then let's explore ways to overcome it together.",
                "You're not alone in feeling scared. Let's work on facing your fears step by step."
            ]
        },
        {
            "tag": "comfort",
            "patterns": [
                "Comforted",
                "Soothed",
                "Calm",
                "Relaxed",
                "Peaceful",
                "Serene",
                "Reassured",
                "Tranquil",
                "Untroubled",
                "At ease"
            ],
            "responses": [
                "I'm glad you're feeling comforted. Remember, I'm here whenever you need support.",
                "Finding moments of peace and calm is important for your well-being. Enjoy the tranquility!",
                "You deserve to feel at ease. Take this time to relax and recharge."
            ]
        },
        {
            "tag": "encouragement",
            "patterns": [
                "Supported",
                "Encouraged",
                "Inspired",
                "Motivated",
                "Strengthened",
                "Assured",
                "Bolstered",
                "Uplifted",
                "Empowered",
                "Reassured"
            ],
            "responses": [
                "You're capable of achieving amazing things! Keep moving forward with confidence.",
                "I believe in you! You have the strength and determination to overcome any challenge.",
                "Your resilience is inspiring. Remember, I'm here to cheer you on every step of the way!"
            ]
        },
        {
            "tag": "gratitude",
            "patterns": [
                "Grateful",
                "Thankful",
                "Appreciative",
                "Acknowledged",
                "Recognized",
                "Indebted",
                "Obliged",
                "Appreciated",
                "Thanked",
                "Valued"
            ],
            "responses": [
                "Your gratitude warms my heart! It's a pleasure to be here for you.",
                "Feeling appreciated is such a wonderful feeling. Thank you for your kind words!",
                "I'm grateful to have you as part of our community. Your support means the world to me."
            ]
        },
        {
            "tag": "loneliness",
            "patterns": [
                "Lonely",
                "Isolated",
                "Alone",
                "Abandoned",
                "Forsaken",
                "Solitary",
                "Deserted",
                "Secluded",
                "Neglected",
                "Desolate"
            ],
            "responses": [
                "I'm here to keep you company. You're not alone in this journey.",
                "Feeling lonely is tough, but remember, there are people who care about you deeply.",
                "Even in moments of solitude, know that you're surrounded by love and support."
            ]
        },
        {
            "tag": "friendship",
            "patterns": [
                "Friend",
                "Companion",
                "Pal",
                "Buddy",
                "Chum",
                "Ally",
                "Confidant",
                "Supporter",
                "Comrade",
                "Acquaintance"
            ],
            "responses": [
                "I'm here to be your friend and confidant. Let's chat!",
                "Friendship is a beautiful bond. I'm grateful to have you as a friend.",
                "Thank you for being such a supportive friend. Your kindness means a lot to me."
            ]
        },
        {
            "tag": "love",
            "patterns": [
                "Love",
                "Affection",
                "Fondness",
                "Devotion",
                "Adoration",
                "Caring",
                "Tenderness",
                "Passion",
                "Warmth",
                "Endearment"
            ],
            "responses": [
                "Love is a powerful emotion. I'm here to offer you love and support whenever you need it.",
                "Your capacity to love and care for others is truly admirable. Keep spreading love!",
                "Remember, you are loved deeply and unconditionally. Let that love guide you through difficult times."
            ]
        },
        {
            "tag": "funny",
            "patterns": [
                "Tell me a joke!",
                "Tell me something funny!",
                "Do you know a joke?"
            ],
            "responses": [
                "Of course! Why did the hipster burn his mouth? He drank the coffee before it was cool.",
                "What did the buffalo say when his son left for college? Bison!",
                "I invented a new word! Plagiarism!"
            ]
        },
        {
            "tag": "morning",
            "patterns": [
                "Good morning"
            ],
            "responses": [
                "Good morning. I hope you had a good night's sleep. How are you feeling today? "
            ]
        },
        {
            "tag": "afternoon",
            "patterns": [
                "Good afternoon"
            ],
            "responses": [
                "Good afternoon. How is your day going?"
            ]
        },
        {
            "tag": "evening",
            "patterns": [
                "Good evening"
            ],
            "responses": [
                "Good evening. How has your day been?"
            ]
        },
        {
            "tag": "night",
            "patterns": [
                "Good night"
            ],
            "responses": [
                "Good night. Get some proper sleep",
                "Good night. Sweet dreams."
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later",
                "Goodbye",
                "Au revoir",
                "Sayonara",
                "ok bye",
                "Bye then",
                "Fare thee well"
            ],
            "responses": [
                "See you later.",
                "Have a nice day.",
                "Bye! Come back again.",
                "I'll see you soon."
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Thank you",
                "That's helpful",
                "Thanks for the help",
                "Than you very much",
                "Thanks for making me feel better",
                "I feel good now because of you"
            ],
            "responses": [
                "Happy to help!",
                "Any time!",
                "My pleasure",
                "You're most welcome!"
            ]
        },
        {
            "tag": "no-response",
            "patterns": [
                ""
            ],
            "responses": [
                "Sorry, I didn't understand you.",
                "Please go on.",
                "Not sure I understand that.",
                "Please don't hesitate to talk to me."
            ]
        },
        {
            "tag": "neutral-response",
            "patterns": [
                "nothing much"
            ],
            "responses": [
                "Oh I see. Do you want to talk about something?"
            ]
        },
        {
            "tag": "skill",
            "patterns": [
                "What can you do?"
            ],
            "responses": [
                "I can provide general advice regarding anxiety and depression, answer questions related to mental health and make daily conversations. Do not consider me as a subsitute for an actual mental healthcare worker. Please seek help if you don't feel satisfied with me."
            ]
        },
        {
            "tag": "help",
            "patterns": [
                "Could you help me?",
                "give me a hand please",
                "Can you help?",
                "What can you do for me?",
                "I need support",
                "I need help",
                "Support me please"
            ],
            "responses": [
                "Sure. Tell me how can i assist you",
                "Tell me your problem so that i can assist you",
                "Yes, sure. How can I help you?"
            ]
        },
        {
            "tag": "sad",
            "patterns": [
                "I am feeling lonely",
                "I am so lonely",
                "I feel down",
                "I feel sad",
                "I am sad",
                "I feel so lonely",
                "I feel empty",
                "I don't have anyone"
            ],
            "responses": [
                "I'm sorry to hear that. I'm here for you. Talking about it might help. So, tell me why do you think you're feeling this way?",
                "I'm here for you. Could you tell me why you're feeling this way?",
                "Why do you think you feel this way?",
                "How long have you been feeling this way?"
            ]
        },
        {
            "tag": "stressed",
            "patterns": [
                "I am so stressed out",
                "I am so stressed",
                "I feel stuck",
                "I still feel stressed",
                "I am so burned out"
            ],
            "responses": [
                "Take a deep breath and gather your thoughts. Go take a walk if possible. Stay hydrated",
                "Give yourself a break. Go easy on yourself.",
                "I am sorry to hear that. What is the reason behind this?",
                "Taking too much stress will affect you negatively. Sometimes, it's better to let go of the thoughts in your head and let your mind chill."
            ]
        },
        {
            "tag": "worthless",
            "patterns": [
                "I feel so worthless.",
                "No one likes me.",
                "I can't do anything.",
                "I am so useless",
                "Nothing makes sense anymore"
            ],
            "responses": [
                "It's only natural to feel this way. Tell me more. What else is on your mind?",
                "Let's discuss further why you're feeling this way.",
                "I  want to let you know that you are not alone in your feelings and there is always someone there to help. You can always change your feelings and change your way of thinking by being open to trying to change.",
                "Don't ever think you cannot achieve what you want. You are capable of reaching your goals. Believe in yourself!"
            ]
        },
        {
            "tag": "let-down",
            "patterns": [
                "I feel I have let my parents down",
                "I let my family down",
                "I let my teammates down",
                "I let my group down"
            ],
            "responses": [
                "If you are the one who let them down you were the one who raised their hopes in the first place. If you have done it once I can guarantee you can do it again."
            ]
        },
        {
            "tag": "depressed",
            "patterns": [
                "I can't take it anymore",
                "I am so depressed",
                "I think I'm depressed.",
                "I have depression",
                "I am anxious",
                "fell depressed",
                "feel lonely",
                "i am depressed"
            ],
            "responses": [
                "It helps to talk about what's happening. You're going to be okay",
                "Talk to me. Tell me more. It helps if you open up yourself to someone else.",
                "Sometimes when we are depressed, it is hard to care about anything. It can be hard to do the simplest of things. Give yourself time to heal."
            ]
        },
        {
            "tag": "happy",
            "patterns": [
                "I feel great today.",
                "I am happy.",
                "I feel happy.",
                "I'm good.",
                "cheerful",
                "I'm fine",
                "I feel ok"
            ],
            "responses": [
                "That's geat to hear. I'm glad you're feeling this way.",
                "That's great.",
                "Did something happen which made you feel this way?"
            ]
        },
        {
            "tag": "casual",
            "patterns": [
                "Oh I see.",
                "ok",
                "okay",
                "nice",
                "Whatever",
                "K",
                "Fine",
                "yeah",
                "yes",
                "no",
                "not really"
            ],
            "responses": [
                "Let's discuss further why you're feeling this way.",
                "How were you feeling last week?",
                "I'm listening. Please go on.",
                "Tell me more",
                "Can you elaborate on that?",
                "Come Come elucidate your thoughts"
            ]
        },
        {
            "tag": "anxious",
            "patterns": [
                "I feel so anxious.",
                "I'm so anxious because of ",
                "I am always worried"
            ],
            "responses": [
                "Don't be hard on yourself. What's the reason behind this?",
                "I understand that it can be scary. Tell me more about it.",
                "Don't let the little worries bring you down. What's the worse that can happen?"
            ]
        },
        {
            "tag": "not-talking",
            "patterns": [
                "I don't want to talk about it.",
                "No just stay away.",
                "I can't bring myself to open up.",
                "Just shut up"
            ],
            "responses": [
                "Talking about something really helps. If you're not ready to open up then that's ok. Just know that i'm here for you, whenever you need me.",
                "I want to help you. I really do. But in order for me to help you, you're gonna have to talk to me.",
                "I'm here to listen to you and help you vent. So please talk to me.",
                "You can talk to me without fear of judgement."
            ]
        },
        {
            "tag": "sleep",
            "patterns": [
                "I have insomnia",
                "I am suffering from insomnia",
                "I can't sleep.",
                "I haven't slept for the last days.",
                "I can't seem to go to sleep.",
                "I haven't had proper sleep for the past few days."
            ],
            "responses": [
                "Insomnia affects millions of people around the world. Don't stay up too late. Forcing youself to sleep might help.",
                "Insomnia affects millions of people around the world. Try sleeping early.",
                "That seems awful. What do you think is behind this?"
            ]
        },
        {
            "tag": "scared",
            "patterns": [
                "I'm scared",
                "That sounds awful. What do i do?",
                "No i don't want to feel this way",
                "I am scared for myself"
            ],
            "responses": [
                "It's only natural to feel this way. I'm here for you.",
                "It'll all be okay. This feeling is only momentary.",
                "I understand how you feel. Don't put yourself down because of it."
            ]
        },
        {
            "tag": "death",
            "patterns": [
                "My mom died",
                "My brother died",
                "My dad passed away",
                "My sister passed away",
                "Someone in my family died",
                "My friend passed away"
            ],
            "responses": [
                "I'm sorry to hear that. If you want to talk about it. I'm here.",
                "I am really sorry to hear that. I am here to help you with grief, anxiety and anything else you may feel at this time.",
                "My condolences. I'm here if you need to talk."
            ]
        },
        {
            "tag": "understand",
            "patterns": [
                "You don't understand me.",
                "You're just some robot. How would you know?",
                "You can't possibly know what i'm going through",
                "You're useless",
                "You can't help me",
                "Nobody understands me."
            ],
            "responses": [
                "It sound like i'm not being very helpful right now.",
                "I'm sorry to hear that. I'm doing my best to help",
                "I'm trying my best to help you. So please talk to me"
            ]
        },
        {
            "tag": "done",
            "patterns": [
                "That's all.",
                "I don't have anything more to say",
                "Nothing else",
                "That's all i have to say",
                "no, that would be all"
            ],
            "responses": [
                "I heard you & noted it all. See you later.",
                "Oh okay we're done for today then. See you later",
                "I hope you have a great day. See you soon",
                "Okay we're done. Have a great day",
                "Okay I see. Enjoy the rest of your day then",
                "Goodbye, I'll always be there to help you!"
            ]
        },
        {
            "tag": "suicide",
            "patterns": [
                "I want to kill myself",
                "I've thought about killing myself.",
                "I want to die",
                "I am going to kill myself",
                "I am going to commit suicide",
                "I want to commit suicide"
            ],
            "responses": [
                "I'm very sorry to hear that but you have so much to look forward to. Please seek help by contacting: (905) xxx-xxxx."
            ]
        },
        {
            "tag": "quit",
            "patterns": [
                "I feel like quitting",
                "I want to quit",
                "I am too tired of this",
                "I have had enough of this"
            ],
            "responses": [
                "Winners never quit and quitters never win is a very common saying, but it isn't easy to follow.",
                "I can understand. But don't ever give up. Keep going and you'll get to where you want to be soon!"
            ]
        },
        {
            "tag": "hate-you",
            "patterns": [
                "I hate you",
                "I don't like you",
                "I don't trust you"
            ],
            "responses": [
                "I'm sorry if i offended you in anyway. I'm only here to help",
                "Forgive me if i did anything to offend you. I only want to help"
            ]
        },
        {
            "tag": "hate-me",
            "patterns": [
                "You hate me",
                "I know you hate me",
                "You don't like me"
            ],
            "responses": [
                "Why do you think so?",
                "I'm sorry if i have exhibited any sort of behaviour to make you think that."
            ]
        },
        {
            "tag": "default",
            "patterns": [
                "exams",
                "friends",
                "relationship",
                "boyfriend",
                "girlfriend",
                "family",
                "money",
                "financial problems"
            ],
            "responses": [
                "Oh I see. Tell me more",
                "I see. What else?",
                "Tell me more about it.",
                "Oh okay. Why don't you tell me more about it?",
                "I'm listening. Tell me more."
            ]
        },
        {
            "tag": "jokes",
            "patterns": [
                "Tell me a joke",
                "Tell me another joke",
                "make me laugh",
                "make me smile"
            ],
            "responses": [
                "mental health is not a joke.",
                "How do functions break up? \n They stop calling each other.",
                "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
                "What did the buffalo say when his son left for college? Bison."
            ]
        },
        {
            "tag": "repeat",
            "patterns": [
                "You already told me that",
                "You mentioned that already",
                "Why are you repeating yourself?"
            ],
            "responses": [
                "Oh sorry I didn't realise that. I'll try not to repeat myself again."
            ]
        },
        {
            "tag": "wrong",
            "patterns": [
                "What are you saying?",
                "That doesn't make sense",
                "Wrong response",
                "Wrong answer"
            ],
            "responses": [
                "I'm very sorry. Let's try that again"
            ]
        },
        {
            "tag": "stupid",
            "patterns": [
                "Are you stupid?",
                "You're crazy",
                "You are dumb",
                "Are you dumb?",
                "you are useless"
            ],
            "responses": [
                "I wish you wouldn't say such hurtful things. I'm sorry if I wasn't useful"
            ]
        },
        {
            "tag": "location",
            "patterns": [
                "Where are you?",
                "Where do you live?",
                "What is your location?"
            ],
            "responses": [
                "Duh I live in your computer",
                "Everywhere",
                "Somewhere in the universe"
            ]
        },
        {
            "tag": "something-else",
            "patterns": [
                "I want to talk about something else",
                "Let's talk about something else.",
                "Can we not talk about this?",
                "I don't want to talk about this."
            ],
            "responses": [
                "Okay sure. What do you want to talk about?",
                "Alright no problem. Is there something you want to talk about?",
                "Is there something else that you want to talk about?"
            ]
        },
        {
            "tag": "friends",
            "patterns": [
                "I don't have any friends"
            ],
            "responses": [
                "I'm sorry to hear that. Just know that I'm here for you. Talking about it might help. Why do you think you don't have any friends?"
            ]
        },
        {
            "tag": "ask",
            "patterns": [
                "Can I ask you something?"
            ],
            "responses": [
                "Sure. I'll try my best to answer you",
                "Of course. Feel free to ask me anything. I'll do my best to answer you"
            ]
        },
        {
            "tag": "problem",
            "patterns": [
                "Probably because my exams are approaching. I feel stressed out because I don't think I've prepared well enough.",
                "probably because of my exams"
            ],
            "responses": [
                "I see. Have you taken any approaches to not feel this way?"
            ]
        },
        {
            "tag": "no-approach",
            "patterns": [
                "I guess not. All I can think about are my exams.",
                "not really",
                "i guess not"
            ],
            "responses": [
                "That's no problem. I can see why you'd be stressed out about that. I can suggest you some tips to alleviate this issue. Would you like to learn more about that?"
            ]
        },
        {
            "tag": "learn-more",
            "patterns": [
                "ok sure. i would like to learn more about it.",
                "yes, i would like to learn more about it.",
                "i would like to learn more about it."
            ],
            "responses": [
                "So first I would suggest you to give yourself a break. Thinking more and more about the problem definitely does not help in solving it. You'll just end up overwhelming yourself.",
                "Some ways to relax include listening to calming music, reading a book, or taking a warm bath. What can I do to help you relax right now?"
            ]
        },
        {
            "tag": "user-agree",
            "patterns": [
                "yeah you're right. i deserve a break.",
                "Yeah you're absolutely right about that"
            ],
            "responses": [
                "Next, I would suggest you to practice meditation. Meditation can produce a deep state of relaxation and a tranquil mind."
            ]
        },
        {
            "tag": "meditation",
            "patterns": [
                "hmmm that sounds like it could be useful to me.",
                "That sounds useful."
            ],
            "responses": [
                "Focus all your attention on your breathing. Concentrate on feeling and listening as you inhale and exhale through your nostrils. Breathe deeply and slowly. When your attention wanders, gently return your focus to your breathing."
            ]
        },
        {
            "tag": "user-meditation",
            "patterns": [
                "i did what you said and i feel alot better. thank you very much.",
                "I feel better now"
            ],
            "responses": [
                "Your welcome. Remember: Always focus on what's within your control. When you find yourself worrying, take a minute to examine the things you have control over. You can't prevent a storm from coming but you can prepare for it. You can't control how someone else behaves, but you can control how you react. Recognize that sometimes, all you can control is your effort and your attitude. When you put your energy into the things you can control, you'll be much more effective."
            ]
        },
        {
            "tag": "pandora-useful",
            "patterns": [
                "thank you very much again. i'll continue practicing meditation and focus on what i can control."
            ],
            "responses": [
                "I'm glad you found this useful. Is there something else I can help you with?"
            ]
        },
        {
            "tag": "user-advice",
            "patterns": [
                "I want some advice.",
                "I need some advice.",
                "I need advice on something"
            ],
            "responses": [
                "Sure. What can I do to help?",
                "Okay what do you need advice on?"
            ]
        },
        {
            "tag": "learn-mental-health",
            "patterns": [
                "I want to learn about mental health.",
                "I want to learn more about mental health.",
                "I'm interested in learning about mental health."
            ],
            "responses": [
                "Oh that's really great. I'd be willing to answer anything that I know about it."
            ]
        },
        {
            "tag": "mental-health-fact",
            "patterns": [
                "Tell me a fact about mental health",
                "Tell me another fact about mental health"
            ],
            "responses": [
                "According to a UNICEF report, One in seven Indians between 15-24 years of age feels depressed",
                "According to UNICEF, 1 in 5 young people (age 13-18) has or will develop a mental illness in their lifetime.",
                "Depression is the leading cause of disability worldwide."
            ]
        },
        {
            "tag": "fact-1",
            "patterns": [
                "What is mental health?",
                "Define Mental Health"
            ],
            "responses": [
                "Mental health is a state of well-being in which the individual realizes his or her own abilities, can cope with the normal stresses of life, can work productively and fruitfully, and is able to make a contribution to his or her community",
                "Mental health includes our emotional, psychological, and social well-being. It affects how we think, feel, and act. It also helps determine how we handle stress, relate to others, and make choices."
            ]
        },
        {
            "tag": "fact-2",
            "patterns": [
                "Why is mental health important?",
                "What is the importance of mental health?"
            ],
            "responses": [
                "Maintaining mental health is crucial to stabilizing constructive behaviors, emotions, and thoughts. Focusing on mental health care can increase productivity, enhance our self-image, and improve relationships."
            ]
        },
        {
            "tag": "fact-3",
            "patterns": [
                "What is Depression?",
                "Define Depression"
            ],
            "responses": [
                "A mental health disorder characterised by persistently depressed mood or loss of interest in activities, causing significant impairment in daily life.",
                "Depression is a common and serious medical illness that negatively affects how you feel, the way you think and how you act."
            ]
        },
        {
            "tag": "fact-5",
            "patterns": [
                "How do i know if i have Depression?",
                "Am i depressed?",
                "Am i suffering from depression?",
                "Am i mentally ill?"
            ],
            "responses": [
                "For a diagnosis of depression, a person needs to have experienced low mood or loss of interest or pleasure in life for at least 2 weeks. Also, they will have experienced the following symptoms: feelings of sadness, hopelessness, or irritability nearly every day."
            ]
        },
        {
            "tag": "fact-6",
            "patterns": [
                "What is a therapist?",
                "What does a therapist do?"
            ],
            "responses": [
                "A therapist is a broad designation that refers to professionals who are trained to provide treatment and rehabilitation. The term is often applied to psychologists, but it can include others who provide a variety of services, including social workers, counselors, life coaches, and many others. "
            ]
        },
        {
            "tag": "fact-7",
            "patterns": [
                "What is therapy?",
                "Do i need therapy?",
                "Who is therapy for?"
            ],
            "responses": [
                "Therapy is a form of treatment that aims to help resolve mental or emotional issues.",
                "Therapy is a form of treatment that aims to help resolve mental or emotional issues. It is helpful for those with mental health conditions or even everyday life challenges."
            ]
        },
        {
            "tag": "fact-8",
            "patterns": [
                "What does it mean to have a mental illness?"
            ],
            "responses": [
                "Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning. They are associated with distress and diminished capacity to engage in the ordinary activities of daily life. Mental illnesses fall along a continuum of severity: some are fairly mild and only interfere with some aspects of life, such as certain phobias. On the other end of the spectrum lie serious mental illnesses, which result in major functional impairment and interference with daily life. These include such disorders as major depression, schizophrenia, and bipolar disorder, and may require that the person receives care in a hospital. It is important to know that mental illnesses are medical conditions that have nothing to do with a person's character, intelligence, or willpower. Just as diabetes is a disorder of the pancreas, mental illness is a medical condition due to the brain's biology. Similarly to how one would treat diabetes with medication and insulin, mental illness is treatable with a combination of medication and social support. These treatments are highly effective, with 70-90 percent of individuals receiving treatment experiencing a reduction in symptoms and an improved quality of life. With the proper treatment, it is very possible for a person with mental illness to be independent and successful."
            ]
        },
        {
            "tag": "fact-9",
            "patterns": [
                "Who does mental illness affect?"
            ],
            "responses": [
                "It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their childs mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."
            ]
        },
        {
            "tag": "fact-10",
            "patterns": [
                "What causes mental illness?"
            ],
            "responses": [
                "It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their child's mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."
            ]
        },
        {
            "tag": "fact-11",
            "patterns": [
                "What are some of the warning signs of mental illness?"
            ],
            "responses": [
                "Symptoms of mental health disorders vary depending on the type and severity of the condition. The following is a list of general symptoms that may suggest a mental health disorder, particularly when multiple symptoms are expressed at once. \n In adults:\n Confused thinking\n Long-lasting sadness or irritability\n Extreme highs and lows in mood\n Excessive fear, worrying, or anxiety\n Social withdrawal\n Dramatic changes in eating or sleeping habits\n Strong feelings of anger\n Delusions or hallucinations (seeing or hearing things that are not really there)\n Increasing inability to cope with daily problems and activities\n Thoughts of suicide\n Denial of obvious problems\n Many unexplained physical problems\n Abuse of drugs and/or alcohol\n \nIn older children and pre-teens:\n Abuse of drugs and/or alcohol\n Inability to cope with daily problems and activities\n Changes in sleeping and/or eating habits\n Excessive complaints of physical problems\n Defying authority, skipping school, stealing, or damaging property\n Intense fear of gaining weight\n Long-lasting negative mood, often along with poor appetite and thoughts of death\n Frequent outbursts of anger\n \nIn younger children:\n Changes in school performance\n Poor grades despite strong efforts\n Excessive worrying or anxiety\n Hyperactivity\n Persistent nightmares\n Persistent disobedience and/or aggressive behavior\n Frequent temper tantrums"
            ]
        },
        {
            "tag": "fact-12",
            "patterns": [
                "Can people with mental illness recover?"
            ],
            "responses": [
                "When healing from mental illness, early identification and treatment are of vital importance. Based on the nature of the illness, there are a range of effective treatments available. For any type of treatment, it is essential that the person affected is proactive and fully engaged in their own recovery process. Many people with mental illnesses who are diagnosed and treated respond well, although some might experience a return of symptoms. Even in such cases, with careful monitoring and management of the disorder, it is still quite possible to live a fulfilled and productive life."
            ]
        },
        {
            "tag": "fact-13",
            "patterns": [
                "What should I do if I know someone who appears to have the symptoms of a mental disorder?"
            ],
            "responses": [
                "Although Pandora cannot substitute for professional advice, we encourage those with symptoms to talk to their friends and family members and seek the counsel of a mental health professional. The sooner the mental health condition is identified and treated, the sooner they can get on the path to recovery. If you know someone who is having problems, don't assume that the issue will resolve itself. Let them know that you care about them, and that there are treatment options available that will help them heal. Speak with a mental health professional or counselor if you think your friend or family member is experiencing the symptoms of a mental health condition. If the affected loved one knows that you support them, they will be more likely to seek out help."
            ]
        },
        {
            "tag": "fact-14",
            "patterns": [
                "How can I find a mental health professional for myself or my child?"
            ],
            "responses": [
                "Feeling comfortable with the professional you or your child is working with is critical to the success of the treatment. Finding the professional who best fits your needs may require research. Start by searching for providers in your area."
            ]
        },
        {
            "tag": "fact-15",
            "patterns": [
                "What treatment options are available?"
            ],
            "responses": [
                "Just as there are different types of medications for physical illness, different treatment options are available for individuals with mental illness. Treatment works differently for different people. It is important to find what works best for you or your child."
            ]
        },
        {
            "tag": "fact-16",
            "patterns": [
                "If I become involved in treatment, what do I need to know?"
            ],
            "responses": [
                "Since beginning treatment is a big step for individuals and families, it can be very overwhelming. It is important to be as involved and engaged in the treatment process as possible. Some questions you will need to have answered include:\n What is known about the cause of this particular illness?\n Are there other diagnoses where these symptoms are common?\n Do you normally include a physical or neurological examination?\n Are there any additional tests or exams that you would recommend at this point?\n Would you advise an independent opinion from another psychiatrist at this point?\n What program of treatment is the most helpful with this diagnosis?\n Will this program involve services by other specialists? If so, who will be responsible for coordinating these services?\n What do you see as the family's role in this program of treatment?\n How much access will the family have to the individuals who are providing the treatment?\n What medications are generally used with this diagnosis?\n How much experience do you have in treating individuals with this illness?\n What can I do to help you in the treatment?"
            ]
        },
        {
            "tag": "fact-17",
            "patterns": [
                "What is the difference between mental health professionals?"
            ],
            "responses": [
                "There are many types of mental health professionals. The variety of providers and their services may be confusing. Each have various levels of education, training, and may have different areas of expertise. Finding the professional who best fits your needs may require some research."
            ]
        },
        {
            "tag": "fact-18",
            "patterns": [
                "How can I find a mental health professional right for my child or myself?"
            ],
            "responses": [
                "Feeling comfortable with the professional you or your child is working with is critical to the success of your treatment. Finding the professional who best fits your needs may require some research."
            ]
        },
        {
            "tag": "fact-19",
            "patterns": [
                "Where else can I get help?"
            ],
            "responses": [
                "Where you go for help will depend on the nature of the problem and/or symptoms and what best fits you. Often, the best place to start is by talking with someone you trust about your concerns, such as a family member, friend, clergy, healthcare provider, or other professionals. Having this social support is essential in healing from mental illness, and you will be able to ask them for referrals or recommendations for trusted mental health practitioners. Search for mental health resources in your area. Secondly, there are people and places throughout the country that provide services to talk, to listen, and to help you on your journey to recovery. Thirdly, many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members, and friends. Some support groups are peer led while others may be led by a mental health professional."
            ]
        },
        {
            "tag": "fact-20",
            "patterns": [
                "What should I know before starting a new medication?"
            ],
            "responses": [
                "The best source of information regarding medications is the physician prescribing them. He or she should be able to answer questions such as:    \n1. What is the medication supposed to do? \n2. When should it begin to take effect, and how will I know when it is effective? \n3. How is the medication taken and for how long? What food, drinks, other medicines, and activities should be avoided while taking this medication? \n4. What are the side effects and what should be done if they occur? \n5. What do I do if a dose is missed? \n6. Is there any written information available about this medication? \n7. Are there other medications that might be appropriate? \n8. If so, why do you prefer the one you have chosen? \n9. How do you monitor medications and what symptoms indicate that they should be raised, lowered, or changed? \n10. All medications should be taken as directed. Most medications for mental illnesses do not work when taken irregularly, and extra doses can cause severe, sometimes dangerous side effects. Many psychiatric medications begin to have a beneficial effect only after they have been taken for several weeks."
            ]
        },
        {
            "tag": "fact-21",
            "patterns": [
                "Where can I go to find therapy?"
            ],
            "responses": [
                "Different kinds of therapy are more effective based on the nature of the mental health condition and/or symptoms and the person who has them (for example, children will benefit from a therapist who specializes in childrens mental health). However, there are several different types of treatment and therapy that can help."
            ]
        },
        {
            "tag": "fact-22",
            "patterns": [
                "Where can I learn about types of mental health treatment?"
            ],
            "responses": [
                "Mental health conditions are often treated with medication, therapy or a combination of the two. However, there are many different types of treatment available, including Complementary & Alternative Treatments, self-help plans, and peer support. Treatments are very personal and should be discussed by the person with the mental health conditions and his or her team."
            ]
        },
        {
            "tag": "fact-23",
            "patterns": [
                "What are the different types of mental health professionals?"
            ],
            "responses": [
                "There are many types of mental health professionals. Finding the right one for you may require some research."
            ]
        },
        {
            "tag": "fact-24",
            "patterns": [
                "Where can I go to find a support group?"
            ],
            "responses": [
                "Many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members and friends. Some support groups are peer-led, while others may be led by a mental health professional."
            ]
        },
        {
            "tag": "fact-25",
            "patterns": [
                "Can you prevent mental health problems?"
            ],
            "responses": [
                "We can all suffer from mental health challenges, but developing our wellbeing, resilience, and seeking help early can help prevent challenges becoming serious."
            ]
        },
        {
            "tag": "fact-26",
            "patterns": [
                "Are there cures for mental health problems?",
                "is there any cure for mental health problems?"
            ],
            "responses": [
                "It is often more realistic and helpful to find out what helps with the issues you face. Talking, counselling, medication, friendships, exercise, good sleep and nutrition, and meaningful occupation can all help."
            ]
        },
        {
            "tag": "fact-27",
            "patterns": [
                "What causes mental health problems?"
            ],
            "responses": [
                "Challenges or problems with your mental health can arise from psychological, biological, and social, issues, as well as life events."
            ]
        },
        {
            "tag": "fact-28",
            "patterns": [
                "What do I do if I'm worried about my mental health?"
            ],
            "responses": [
                "The most important thing is to talk to someone you trust. This might be a friend, colleague, family member, or GP. In addition to talking to someone, it may be useful to find out more information about what you are experiencing. These things may help to get some perspective on what you are experiencing, and be the start of getting help."
            ]
        },
        {
            "tag": "fact-29",
            "patterns": [
                "How do I know if I'm unwell?"
            ],
            "responses": [
                "If your beliefs , thoughts , feelings or behaviours have a significant impact on your ability to function in what might be considered a normal or ordinary way, it would be important to seek help."
            ]
        },
        {
            "tag": "fact-30",
            "patterns": [
                "How can I maintain social connections? What if I feel lonely?",
                "I feel very alone. Help me",
                "I have no one with me. I feel alone"
            ],
            "responses": [
                "A lot of people are alone right now, but we don't have to be lonely. We're all in this together. Think about the different ways to connect that are most meaningful for you. For example, you might prefer a video chat over a phone call, or you might prefer to text throughout the day rather than one set time for a video call. Then, work with your social networks to make a plan. You might video chat with your close friends in the evening and phone a family member once a week. Remember to be mindful of people who may not be online. Check in by phone and ask how you can help. The quality of your social connections matter. Mindlessly scrolling through social media and liking a few posts usually doesn't build strong social connections. Make sure you focus on strategies that actually make you feel included and connected. If your current strategies don't help you feel connected, problem-solve to see if you can find a solution. Everyone feels lonely at times. Maybe you recently moved to a new city, are changing your circle of friends, lost someone important in your life, or lost your job and also lost important social connections with coworkers. Other people may have physical connections to others but may feel like their emotional or social needs aren't met. Measures like social distancing or self-isolation can make loneliness feel worse no matter why you feel lonely now. Reach out to the connections you do have. Suggest ways to keep in touch and see if you can set a regular time to connect. People may hesitate to reach out for a lot of different reasons, so don't be afraid to be the one who asks. Look for local community support groups and mutual aid groups on social media. This pandemic is bringing everyone together, so look for opportunities to make new connections. These groups are a great way to share your skills and abilities or seek help and support. Look for specialized support groups. Support groups are moving online, and there are a lot of different support lines to call if you need to talk to someone."
            ]
        },
        {
            "tag": "fact-31",
            "patterns": [
                "What's the difference between anxiety and stress?"
            ],
            "responses": [
                "Stress and anxiety are often used interchangeably, and there is overlap between stress and anxiety. Stress is related to the same fight, flight, or freeze response as anxiety, and the physical sensations of anxiety and stress may be very similar. The cause of stress and anxiety are usually different, however. Stress focuses on mainly external pressures on us that we're finding hard to cope with. When we are stressed, we usually know what we're stressed about, and the symptoms of stress typically disappear after the stressful situation is over. Anxiety, on the other hand, isn't always as easy to figure out. Anxiety focuses on worries or fears about things that could threaten us, as well as anxiety about the anxiety itself. Stress and anxiety are both part of being human, but both can be problems if they last for a long time or have an impact on our well-being or daily life."
            ]
        },
        {
            "tag": "fact-32",
            "patterns": [
                "What's the difference between sadness and depression?",
                "difference between sadness and depression"
            ],
            "responses": [
                "Sadness is a normal reaction to a loss, disappointment, problems, or other difficult situations. Feeling sad from time to time is just another part of being human. In these cases, feelings of sadness go away quickly and you can go about your daily life. Other ways to talk about sadness might be feeling low, feeling down, or feeling blue.A person may say they are feeling depressed, but if it goes away on its own and doesn't impact life in a big way, it probably isn't the illness of depression. Depression is a mental illness that affects your mood, the way you understand yourself, and the way you understand and relate to things around you. It can also go by different names, such as clinical depression, major depressive disorder, or major depression. Depression can come up for no reason, and it lasts for a long time. It's much more than sadness or low mood. People who experience depression may feel worthless or hopeless. They may feel unreasonable guilty. Some people may experience depression as anger or irritability. It may be hard to concentrate or make decisions. Most people lose interest in things that they used to enjoy and may isolate themselves from others. There are also physical signs of depression, such as problems with sleep, appetite and energy and unexplainable aches or pains. Some may experience difficult thoughts about death or ending their life (suicide). Depression lasts longer than two weeks, doesn't usually go away on its own, and impacts your life. It's a real illness, and it is very treatable. It's important to seek help if you're concerned about depression."
            ]
        }
    ]
}
